Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
ambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getConfiguration]
module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getMap]
module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-deidentifyFiles]
module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getInfo]
module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-performQuery]
module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-indexer]
module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getEntryTypes]
module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-updateFiles]
module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-deleteClinicalWorkflow]
module.cognito.aws_cognito_user_group.manager_group: Refreshing state... [id=ap-southeast-3_TxZFmgKtd/managers]
module.cognito.aws_iam_role_policy_attachment.manager_group_role_policy_attachment: Refreshing state... [id=gaspi-manager-group-role-20250815040358558600000002]
module.cognito.aws_iam_role_policy.gaspi_unauthenticated: Refreshing state... [id=gaspi_unauthenticated:unauthenticated_policy]
module.cognito.aws_iam_role_policy_attachment.admin_group_role_policy_attachment: Refreshing state... [id=gaspi-admin-group-role-20250815040355622500000001]
module.cognito.aws_cognito_user_group.admin_group: Refreshing state... [id=ap-southeast-3_TxZFmgKtd/administrators]
module.cognito.aws_iam_role_policy.gaspi_authenticated: Refreshing state... [id=gaspi_authenticated:authenticated_policy]
module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles: Refreshing state... [id=ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0]
module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs]
module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-queryGTF]
module.svep[0].aws_lambda_permission.vcfstats_graphic_invoke_permission: Refreshing state... [id=APIVcfstatsAllowInvoke]
module.svep[0].aws_api_gateway_integration.vcfstats-post: Refreshing state... [id=agi-pihbmfom84-t1qsgu-POST]
module.svep[0].aws_api_gateway_integration.vcfstats-patch: Refreshing state... [id=agi-pihbmfom84-t1qsgu-PATCH]
module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-pluginClinvar]
module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-pluginGnomad]
module.sbeacon.module.cors-info-root.aws_api_gateway_method._: Refreshing state... [id=agm-auudf51p4c-fljl4i4t93-OPTIONS]
module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-pluginConsequence]
module.sbeacon.aws_api_gateway_method_response.biosamples_post: Refreshing state... [id=agmr-auudf51p4c-6bnaby-POST-200]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_integration_response._: Refreshing state... [id=agir-auudf51p4c-zjwczl-OPTIONS-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples_post: Refreshing state... [id=agmr-auudf51p4c-nb8c7s-POST-200]
module.svep[0].module.lambda-createPages.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-createPages]
module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-concatPages]
module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-queryVCF]
module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-concatStarter]
module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-pluginGnomadConstraint]
module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-queryVCFsubmit]
module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-pluginGnomadOneKG]
module.svep[0].module.lambda-concat.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-concat]
module.svep[0].aws_api_gateway_integration.qcnotes-post: Refreshing state... [id=agi-pihbmfom84-5yb9hf-POST]
module.svep[0].aws_api_gateway_integration.qcnotes-get: Refreshing state... [id=agi-pihbmfom84-5yb9hf-GET]
module.svep[0].aws_lambda_permission.qcNotes_invoke_permission: Refreshing state... [id=SvepAPIQcNotesAllowInvoke]
module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-sendJobEmail]
module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-initQuery]
module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-formatOutput]
module.svep[0].aws_lambda_permission.cloudwatch_batch_starter_invoke_permission: Refreshing state... [id=CloudwatchBatchStarterAllowInvoke]
module.svep[0].aws_cloudwatch_event_target.batch_starter_trigger: Refreshing state... [id=svep-backend-batchStarterTrigger-lambda-batchStarter]
module.svep[0].aws_sns_topic_subscription.updateReferenceFiles: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-updateReferenceFiles:2735e8c3-8a54-4290-8fe0-1a961508f3d3]
module.svep[0].aws_cloudwatch_event_target.update_references_trigger: Refreshing state... [id=svep_update_references_trigger-lambda-updateReferenceFiles]
module.svep[0].aws_lambda_permission.sns_update_reference_files_invoke_permission: Refreshing state... [id=SNSUpdateReferenceFilesAllowInvoke]
module.svep[0].aws_lambda_permission.cloudwatch_svep_reference_update_permission: Refreshing state... [id=CloudwatchSvepReferenceUpdateAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.update_reference_files_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.cloudwatch_update_reference_files_invoke_permission: Refreshing state... [id=CloudwatchUpdateReferenceFilesAllowInvoke]
module.svep[0].aws_lambda_permission.get_results_invoke_permission: Refreshing state... [id=APIGetResultsAllowInvoke]
module.svep[0].aws_api_gateway_integration.results-get: Refreshing state... [id=agi-pihbmfom84-vu4rlt-GET]
module.svep[0].aws_lambda_permission.batch_submit_invoke_permission: Refreshing state... [id=APIBatchSubmitAllowInvoke]
module.svep[0].aws_api_gateway_integration.batch-submit-post: Refreshing state... [id=agi-pihbmfom84-fl7bsu-POST]
module.cognito.aws_cognito_user_in_group.admin_in_admin_group: Refreshing state... [id=ap-southeast-3_TxZFmgKtd,administrators,admin@example.com]
module.svep[0].aws_api_gateway_integration_response.vcfstats-patch: Refreshing state... [id=agir-pihbmfom84-t1qsgu-PATCH-200]
module.svep[0].aws_api_gateway_integration_response.vcfstats-post: Refreshing state... [id=agir-pihbmfom84-t1qsgu-POST-200]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration._: Refreshing state... [id=agi-auudf51p4c-fljl4i4t93-OPTIONS]
module.sbeacon.module.cors-info-root.aws_api_gateway_method_response._: Refreshing state... [id=agmr-auudf51p4c-fljl4i4t93-OPTIONS-200]
module.sbeacon.aws_lambda_permission.APIGetProjects: Refreshing state... [id=AllowAPIGetProjectsInvoke]
module.sbeacon.aws_api_gateway_integration.projects: Refreshing state... [id=agi-auudf51p4c-rm9uin-GET]
module.sbeacon.aws_api_gateway_integration.configuration: Refreshing state... [id=agi-auudf51p4c-xvqnjq-GET]
module.sbeacon.aws_lambda_permission.APIGetConfiguration: Refreshing state... [id=AllowAPIGetConfigurationInvoke]
module.sbeacon.aws_api_gateway_integration.filtering_terms: Refreshing state... [id=agi-auudf51p4c-jzqmn2-GET]
module.sbeacon.aws_lambda_permission.APIGetFilteringTerms: Refreshing state... [id=AllowAPIGetFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIGetmap: Refreshing state... [id=AllowAPIGetMapInvoke]
module.sbeacon.aws_api_gateway_integration.map: Refreshing state... [id=agi-auudf51p4c-9gfn10-GET]
module.sbeacon.aws_lambda_permission.SNSperformQuery: Refreshing state... [id=SBeaconBackendAllowSNSperformQueryInvoke]
module.sbeacon.aws_sns_topic_subscription.performQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:performQuery:bc308a73-3286-4469-ab4a-f222c58cf6a6]
module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery: Read complete after 0s [id=2401159296]
module.sbeacon.aws_lambda_permission.S3deidentifyFiles: Refreshing state... [id=SBeaconBackendAllowS3deidentifyFilesInvoke]
module.sbeacon.aws_lambda_permission.APIGetinfo-root: Refreshing state... [id=AllowAPIGetinfoRootInvoke]
module.sbeacon.aws_lambda_permission.APIGetInfo: Refreshing state... [id=AllowAPIGetInfoInvoke]
module.sbeacon.aws_api_gateway_integration.root-get: Refreshing state... [id=agi-auudf51p4c-fljl4i4t93-GET]
module.svep[0].aws_api_gateway_integration_response.results-get: Refreshing state... [id=agir-pihbmfom84-vu4rlt-GET-200]
module.sbeacon.aws_api_gateway_integration.info: Refreshing state... [id=agi-auudf51p4c-kr9g05-GET]
module.sbeacon.aws_lambda_permission.APIGetEntryTypes: Refreshing state... [id=AllowAPIGetEntryTypesInvoke]
module.sbeacon.aws_api_gateway_integration.entry_types: Refreshing state... [id=agi-auudf51p4c-5o3l4j-GET]
module.sbeacon.aws_lambda_permission.S3updateFiles: Refreshing state... [id=SBeaconBackendAllowS3updateFilesInvoke]
module.svep[0].aws_cloudwatch_event_target.delete_clinical_trigger: Refreshing state... [id=svep_delete_clinical_trigger-lambda-deleteClinicalWorkflow]
module.svep[0].aws_lambda_permission.cloudwatch_delete_clinical_workflow_invoke_permission: Refreshing state... [id=CloudwatchDeleteClinicalWorkflowAllowInvoke]
module.svep[0].aws_api_gateway_integration_response.batch-submit-post: Refreshing state... [id=agir-pihbmfom84-fl7bsu-POST-200]
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Reading...
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Read complete after 0s [id=1061377007]
module.svep[0].aws_sns_topic_subscription.queryGTF: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryGTF:e0d0b0a4-3ee4-4dd6-bf2b-3485cd136e2e]
module.svep[0].aws_lambda_permission.query_gtf_invoke_permission: Refreshing state... [id=SNSQueryGTFAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.query_gtf_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.pluginClinvar: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginClinvar:ca9c0900-9b0f-411d-9104-9fc5373cf1d7]
module.svep[0].aws_lambda_permission.plugin_clinvar_invoke_permission: Refreshing state... [id=SNSPluginClinvarAllowInvoke]
module.svep[0].aws_sns_topic_subscription.pluginGnomad: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomad:8dff79b5-d187-4674-a3af-4d5cdabb8e19]
module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_invoke_permission: Refreshing state... [id=SNSPluginGnomadAllowInvoke]
module.svep[0].aws_lambda_permission.plugin_consequence_invoke_permission: Refreshing state... [id=SNSPluginConsequenceAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.plugin_consequence_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.pluginConsequence: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginConsequence:dae37282-6f6c-4cc6-83c5-3881810f7d4c]
module.svep[0].aws_sns_topic_subscription.createPages: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-createPages:a810ded3-1617-4f5a-880c-c2b141902346]
module.svep[0].aws_lambda_permission.create_pages_invoke_permission: Refreshing state... [id=SNSCreatePagesAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.create_pages_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.concatPages: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concatPages:bc17b54c-a2b4-4a58-b6f6-3a445c3ebe65]
module.svep[0].aws_lambda_permission.concat_pages_invoke_permission: Refreshing state... [id=SNSConcatPagesAllowInvoke]
module.svep[0].aws_sns_topic_subscription.queryVCF: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryVCF:af9a9502-b6c6-477d-a14f-7dd29754a4a2]
module.svep[0].aws_lambda_function_recursion_config.query_vcf_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.query_vcf_invoke_permission: Refreshing state... [id=SNSQueryVCFAllowInvoke]
module.svep[0].aws_sns_topic_subscription.concatStarter: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concatStarter:a1ec32e1-39ec-41de-9f30-5f5c9ea598be]
module.svep[0].aws_lambda_permission.concat_starter_invoke_permission: Refreshing state... [id=SNSConcatStarterAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.concat_starter_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.pluginGnomadConstraint: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomadConstraint:9b574605-2a70-4e05-a097-2224adb029b2]
module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_constraint_invoke_permission: Refreshing state... [id=SNSPluginGnomadAllowInvoke]
module.svep[0].aws_lambda_permission.query_vcf_submit_invoke_permission: Refreshing state... [id=SNSQueryVCFSubmitAllowInvoke]
module.svep[0].aws_sns_topic_subscription.queryVCFsubmit: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryVCFsubmit:a1bdf212-4003-4dc2-99b2-6f9859f8d00f]
module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_one_kg_invoke_permission: Refreshing state... [id=SNSPluginGnomadAllowInvoke]
module.svep[0].aws_sns_topic_subscription.pluginGnomadOneKG: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomadOneKG:deff122c-bdf2-48b6-ad80-fc5ae4f8c7ff]
module.sbeacon.aws_api_gateway_integration_response.projects: Refreshing state... [id=agir-auudf51p4c-rm9uin-GET-200]
module.svep[0].aws_sns_topic_subscription.concat: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concat:a264b532-73ae-41d0-b3ab-e04ef36f4257]
module.sbeacon.aws_api_gateway_integration_response.configuration: Refreshing state... [id=agir-auudf51p4c-xvqnjq-GET-200]
module.svep[0].aws_lambda_permission.concat_invoke_permission: Refreshing state... [id=SNSConcatAllowInvoke]
module.sbeacon.aws_api_gateway_integration_response.filtering_terms: Refreshing state... [id=agir-auudf51p4c-jzqmn2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.map: Refreshing state... [id=agir-auudf51p4c-9gfn10-GET-200]
module.svep[0].aws_lambda_permission.plugin_send_job_email_invoke_permission: Refreshing state... [id=SNSSendJobEmailAllowInvoke]
module.svep[0].aws_sns_topic_subscription.sendJobEmail: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail:a9b2e92a-3083-4519-a6af-b0727e28ee74]
module.svep[0].aws_api_gateway_integration.submit-post: Refreshing state... [id=agi-pihbmfom84-g7sppc-POST]
module.svep[0].aws_api_gateway_integration.submit-patch: Refreshing state... [id=agi-pihbmfom84-g7sppc-PATCH]
module.svep[0].aws_lambda_permission.initquery_invoke_permission_sns: Refreshing state... [id=SNSInitQueryAllowInvoke]
module.svep[0].aws_lambda_permission.init_query_invoke_permission: Refreshing state... [id=APIInitQueryAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.init_query_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.formatOutput_invoke_permission: Refreshing state... [id=SNSformatOutputAllowInvoke]
module.svep[0].aws_sns_topic_subscription.initQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-initQuery:1f4427e4-9d4b-4054-bae5-94b307020592]
module.sbeacon.aws_api_gateway_integration_response.root-get: Refreshing state... [id=agir-auudf51p4c-fljl4i4t93-GET-200]
module.svep[0].aws_sns_topic_subscription.formatOutput: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-formatOutput:02cc322c-2322-4bbf-9263-7bd36ee9c6f3]
module.sbeacon.aws_api_gateway_integration_response.info: Refreshing state... [id=agir-auudf51p4c-kr9g05-GET-200]
module.sbeacon.aws_s3_bucket_notification.updateFiles: Refreshing state... [id=gasi-dataportal-20250513021720562800000002]
module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=sbeacon-backend-splitQuery:sbeacon-backend-splitQuery]
module.svep[0].aws_api_gateway_integration_response.submit-post: Refreshing state... [id=agir-pihbmfom84-g7sppc-POST-200]
module.svep[0].aws_api_gateway_integration_response.submit-patch: Refreshing state... [id=agir-pihbmfom84-g7sppc-PATCH-200]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-admin]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.svep[0].aws_api_gateway_integration_response.qcnotes-post: Refreshing state... [id=agir-pihbmfom84-5yb9hf-POST-200]
module.svep[0].aws_api_gateway_integration_response.qcnotes-get: Refreshing state... [id=agir-pihbmfom84-5yb9hf-GET-200]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-auudf51p4c-o542q0-ANY]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-splitQuery]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-dataPortal]
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Read complete after 0s [id=2129060850]
module.sbeacon.aws_sns_topic_subscription.splitQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:splitQuery:d63f3a2c-0cff-4303-88c8-aafde1c5574a]
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Read complete after 0s [id=2129060850]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Read complete after 0s [id=2129060850]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Read complete after 0s [id=2129060850]
module.sbeacon.aws_lambda_permission.SNSsplitQuery: Refreshing state... [id=SBeaconBackendAllowSNSsplitQueryInvoke]
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Read complete after 0s [id=2129060850]
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Read complete after 0s [id=1204524327]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-3]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-3]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2]
module.sbeacon.aws_api_gateway_integration_response.entry_types: Refreshing state... [id=agir-auudf51p4c-5o3l4j-GET-200]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.svep[0].aws_api_gateway_deployment.VPApi: Refreshing state... [id=3trr1a]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-auudf51p4c-o542q0-ANY-200]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-auudf51p4c-zjwczl-ANY]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.svep[0].aws_api_gateway_stage.VPApi: Refreshing state... [id=ags-pihbmfom84-prod]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-auudf51p4c-3o2mt5-POST]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-auudf51p4c-1q0gx4-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-auudf51p4c-a62i9b-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-vxkjof-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-auudf51p4c-vxkjof-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-a62i9b-POST]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-auudf51p4c-1q0gx4-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-auudf51p4c-3o2mt5-GET]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-auudf51p4c-jnmq3v-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-auudf51p4c-fyhv7o-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-auudf51p4c-ubnq59-GET]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-auudf51p4c-o1bur6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-tx4nza-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-y5t5hi-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-auudf51p4c-3vivi6-GET]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-ubnq59-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-3vivi6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-auudf51p4c-y5t5hi-GET]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-auudf51p4c-o1bur6-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-jnmq3v-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-auudf51p4c-fyhv7o-GET]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-auudf51p4c-kga52w-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-auudf51p4c-vqjww2-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-ho1m5d-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-yoq0wr-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-auudf51p4c-ho1m5d-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-auudf51p4c-kga52w-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-auudf51p4c-yoq0wr-GET]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-auudf51p4c-j5giw6-GET]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-auudf51p4c-j5giw6-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-vqjww2-POST]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=pihbmfom84-prod-*/*]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2VOWED91CBL3B]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-auudf51p4c-3o2mt5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-auudf51p4c-a62i9b-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-vxkjof-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-a62i9b-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-auudf51p4c-vxkjof-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-auudf51p4c-1q0gx4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-auudf51p4c-jnmq3v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-auudf51p4c-ubnq59-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-auudf51p4c-fyhv7o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-tx4nza-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-auudf51p4c-o1bur6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-auudf51p4c-3vivi6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-3vivi6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-auudf51p4c-y5t5hi-GET-200]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-auudf51p4c-zjwczl-ANY-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-jnmq3v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-auudf51p4c-fyhv7o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-auudf51p4c-o1bur6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-auudf51p4c-vqjww2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-ho1m5d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-yoq0wr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-y5t5hi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-auudf51p4c-ho1m5d-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-auudf51p4c-kga52w-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-auudf51p4c-kga52w-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-auudf51p4c-j5giw6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-vqjww2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-auudf51p4c-1q0gx4-GET-200]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-auudf51p4c-nb8c7s-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-auudf51p4c-sjks3s-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-facarh-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-3jtaho-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-nb8c7s-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-auudf51p4c-facarh-GET]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-auudf51p4c-u79iwd-GET]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-auudf51p4c-u79iwd-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-auudf51p4c-3jtaho-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-auudf51p4c-sjks3s-GET]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-auudf51p4c-19r55o-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-19r55o-POST]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-auudf51p4c-3n9fhg-POST]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-auudf51p4c-budf3y-POST]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-auudf51p4c-budf3y-GET]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-auudf51p4c-zajmnx-GET]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-auudf51p4c-3n9fhg-GET]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-zajmnx-POST]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-auudf51p4c-j5giw6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-ubnq59-POST-200]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-auudf51p4c-nftwai-GET]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-auudf51p4c-6bnaby-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-auudf51p4c-pgsebc-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-nftwai-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-auudf51p4c-q1jifp-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-1yp0in-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-auudf51p4c-q1jifp-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-auudf51p4c-j0sm1h-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-auudf51p4c-j0sm1h-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-auudf51p4c-1yp0in-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-pgsebc-POST]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-auudf51p4c-6bnaby-POST]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-auudf51p4c-nb8c7s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-auudf51p4c-sjks3s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-facarh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-auudf51p4c-yoq0wr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-3jtaho-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-auudf51p4c-facarh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-auudf51p4c-u79iwd-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-auudf51p4c-3jtaho-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-auudf51p4c-sjks3s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-auudf51p4c-19r55o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-19r55o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-auudf51p4c-3n9fhg-POST-200]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-auudf51p4c-fljl4i4t93-OPTIONS-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-auudf51p4c-3n9fhg-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-zajmnx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-auudf51p4c-u79iwd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-auudf51p4c-zajmnx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-auudf51p4c-budf3y-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-1yp0in-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-auudf51p4c-budf3y-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-auudf51p4c-q1jifp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-auudf51p4c-j0sm1h-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-auudf51p4c-pgsebc-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms: Refreshing state... [id=agmr-auudf51p4c-tx4nza-GET-200]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-auudf51p4c-tx4nza-GET]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-pgsebc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-auudf51p4c-nftwai-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-auudf51p4c-6bnaby-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-auudf51p4c-q1jifp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-nb8c7s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-auudf51p4c-6bnaby-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-nftwai-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-auudf51p4c-1yp0in-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-auudf51p4c-tx4nza-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-auudf51p4c-j0sm1h-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-auudf51p4c-3o2mt5-GET-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=axo133]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-auudf51p4c-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=auudf51p4c-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1ACA5WT51ELER]
module.webgui.data.external.build: Reading...
module.gaspifs.null_resource.gaspifs-upload: Refreshing state... [id=4307977406022670611]
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=b8634475-d812-42ad-9dde-cd31725a80cb]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E8Z5K385KM143]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=4144518607]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=ba70017e-e569-6054-eaf2-9a376faeaf97]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250513021738584800000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Still reading... [1m20s elapsed]
module.webgui.data.external.build: Read complete after 1m21s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=7501596788654961346]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=4857698419747107289]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:953f9052efb3fa3bf1b716d69867dbea402c36c4da1a873757e5075e94d39f10460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:953f9052efb3fa3bf1b716d69867dbea402c36c4da1a873757e5075e94d39f10" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:686ee8c7519980d34d60d3e4c2641a3523566ec81f3a629075eeb44136783a85460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:686ee8c7519980d34d60d3e4c2641a3523566ec81f3a629075eeb44136783a85" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:54ca388cd09a38ca7a5ddbcf38d715f9aa7b8e5f41be7729437adfffbc65b91c460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:54ca388cd09a38ca7a5ddbcf38d715f9aa7b8e5f41be7729437adfffbc65b91c" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_analyses"
        name               = "sbeacon_analyses"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114305_00007_kyyg6" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/analyses/" -> "s3://gasi-metadata-20250513021731641000000004/analyses"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_biosamples"
        name               = "sbeacon_biosamples"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114305_00039_7f2be" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/biosamples/" -> "s3://gasi-metadata-20250513021731641000000004/biosamples"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (22 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_datasets"
        name               = "sbeacon_datasets"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114304_00079_5c442" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_assemblyid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/datasets/" -> "s3://gasi-metadata-20250513021731641000000004/datasets"
          - number_of_buckets         = 10 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_individuals"
        name               = "sbeacon_individuals"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114305_00087_xn5q7" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/individuals/" -> "s3://gasi-metadata-20250513021731641000000004/individuals"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-relations" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_relations"
        name               = "sbeacon_relations"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114311_00031_e6hvr" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "individualid",
              - "biosampleid",
              - "runid",
              - "analysisid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/relations/" -> "s3://gasi-metadata-20250513021731641000000004/relations"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114305_00023_qc9dk" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/runs/" -> "s3://gasi-metadata-20250513021731641000000004/runs"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:15" -> (known after apply)
      ~ code_sha256                 = "qMFayWHFm86m1pXzrioWdKCGQE40dS5yUA29SbHA/t0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-23T03:23:56.190+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:15" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "gf+k9RbENqHUtv+ew0ARPOTAUZadBWy8NbSc7GVu24nS2cJrJM1SAIiL8U4LLwF8SceB8wDtTr/y85I2wnZV0g==" -> "HHpiH1Lpszi7OcYbLIbsgGVvytLkQIl0FnK4tR3LNgrgPplDOHUb7pQHkSJ3xjNWqoXuR5EpB2pxYwvmoItBgA==" # forces replacement
      ~ source_code_size            = 18449813 -> (known after apply)
      ~ version                     = "15" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gasi-dataportal-20250513021720562800000002"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16" -> (known after apply)
      ~ code_sha256                 = "DIJMGhiaqfW7pvSst0frR0e4kXnotWLk/8+SrUl9UcU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-23T03:23:59.296+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "n0y+Dbks4JhpT5Vx2Ho50pkf9FWLY7bymB4gDdaF9Yv4dc9G5voZkK8MSPXmfjJlMUnSvMSSPtK3PB4UFdcytg==" -> "ys3YJ4YVy/vSBrsUP/eqGf//tCreRzol9xm2WqSgJ8i/WXZgUl92j2migQzURK0HlOZU1zvAwOE3Cv2kSsuyDQ==" # forces replacement
      ~ source_code_size            = 17976009 -> (known after apply)
      ~ version                     = "16" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      + content                       = "v1.1.0-78-geb601524+"
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "4857698419747107289" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "c7dc98f1636d6f0a6899785302a3146a8459d550" -> "e4a9fedded624f503accebfbee17fd48914c8c11"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "7501596788654961346" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "c7dc98f1636d6f0a6899785302a3146a8459d550" -> "e4a9fedded624f503accebfbee17fd48914c8c11"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "ba70017e-e569-6054-eaf2-9a376faeaf97" -> (known after apply)
      ~ triggers_replace = [
          ~ "" -> "v1.1.0-78-geb601524+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4870139584108961504" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615132430706000" -> "1758771068211033200"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4281836413529953894" -> (known after apply)
      ~ triggers =
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.